Table of Contents
 Enum HangingType
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Type of hanging
public enum HangingType
Fields
AngleAnchorLShapedBranches = 3
Angle anchor with L-shaped branches _/_
AngleAnchorStraightBranches = 2
Angle anchor with straight branches /\
StraightAnchorLShapedBranches = 1
Straight anchor with L-shaped branches
StraightAnchorSingleBar = 4
Straight single bar
StraightAnchorStraightBranches = 0
Straight anchor with straight branches
Fields
 Name |  Description
 AngleAnchorLShapedBranches = 3
Angle anchor with L-shaped branches _/_
 AngleAnchorStraightBranches = 2
Angle anchor with straight branches /\
 StraightAnchorLShapedBranches = 1
Straight anchor with L-shaped branches
 StraightAnchorSingleBar = 4
Straight single bar
 StraightAnchorStraightBranches = 0
Straight anchor with straight branches
 Edit this page